'''
Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.
Найдите количество и выведите его.

Пример:

list_1 = [1, 2, 3, 4, 5]
k = 3
# 1

'''

list_1 = [2, 4, 1, 6, 8, 2, 9, 3, 2, 5]
k = 2

print(list_1.count(k))